; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	satellite8 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	thermograph1 - mode
	thermograph0 - mode
	infrared4 - mode
	thermograph3 - mode
	image2 - mode
	Star3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph3)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument7 thermograph1)
	(supports instrument7 image2)
	(supports instrument7 infrared4)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 thermograph3)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star3)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet9)
	(supports instrument10 thermograph1)
	(supports instrument10 image2)
	(calibration_target instrument10 GroundStation5)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 image2)
	(calibration_target instrument11 Star4)
	(calibration_target instrument11 Star3)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon6)
	(supports instrument12 infrared4)
	(calibration_target instrument12 GroundStation0)
	(calibration_target instrument12 Star3)
	(supports instrument13 image2)
	(calibration_target instrument13 Star4)
	(calibration_target instrument13 GroundStation1)
	(supports instrument14 thermograph0)
	(supports instrument14 image2)
	(calibration_target instrument14 Star4)
	(calibration_target instrument14 GroundStation0)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet8)
	(supports instrument15 image2)
	(supports instrument15 thermograph1)
	(calibration_target instrument15 GroundStation5)
	(calibration_target instrument15 Star4)
	(on_board instrument15 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Phenomenon10)
	(supports instrument16 thermograph3)
	(calibration_target instrument16 GroundStation2)
	(supports instrument17 image2)
	(calibration_target instrument17 GroundStation5)
	(supports instrument18 image2)
	(supports instrument18 thermograph1)
	(calibration_target instrument18 GroundStation5)
	(on_board instrument16 satellite8)
	(on_board instrument17 satellite8)
	(on_board instrument18 satellite8)
	(power_avail satellite8)
	(pointing satellite8 GroundStation1)
)
(:goal (and
	(pointing satellite2 Planet8)
	(pointing satellite3 Star4)
	(pointing satellite5 Planet9)
	(pointing satellite6 Planet9)
	(pointing satellite8 Star3)
	(have_image Phenomenon6 infrared4)
	(have_image Planet7 image2)
	(have_image Planet8 thermograph1)
	(have_image Planet9 infrared4)
	(have_image Phenomenon10 image2)
))

)

; plan
1. (turn_to satellite6 planet9 planet8)
   deleted: (pointing satellite6 planet8)
   added: (pointing satellite6 planet9)
   goals met: 1 of 10
2. (turn_to satellite5 planet9 phenomenon6)
   deleted: (pointing satellite5 phenomenon6)
   added: (pointing satellite5 planet9)
   goals met: 2 of 10
3. (turn_to satellite4 groundstation0 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 groundstation0)
   goals met: 2 of 10
4. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 2 of 10
5. (calibrate satellite4 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 2 of 10
6. (turn_to satellite4 phenomenon6 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon6)
   goals met: 2 of 10
7. (take_image satellite4 phenomenon6 instrument7 infrared4)
   added: (have_image phenomenon6 infrared4)
   goals met: 3 of 10
8. (turn_to satellite4 phenomenon10 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon10)
   goals met: 3 of 10
9. (turn_to satellite3 star4 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 star4)
   goals met: 4 of 10
10. (turn_to satellite2 planet8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet8)
   goals met: 5 of 10
11. (take_image satellite4 phenomenon10 instrument7 image2)
   added: (have_image phenomenon10 image2)
   goals met: 6 of 10
12. (turn_to satellite4 planet7 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet7)
   goals met: 6 of 10
13. (take_image satellite4 planet7 instrument7 image2)
   added: (have_image planet7 image2)
   goals met: 7 of 10
14. (turn_to satellite4 planet8 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet8)
   goals met: 7 of 10
15. (take_image satellite4 planet8 instrument7 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 8 of 10
16. (turn_to satellite4 planet9 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet9)
   goals met: 8 of 10
17. (take_image satellite4 planet9 instrument7 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 9 of 10
18. (turn_to satellite8 star3 groundstation1)
   deleted: (pointing satellite8 groundstation1)
   added: (pointing satellite8 star3)
   goals met: 10 of 10
